In [35]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [14]:
df_orig = pd.read_csv('equity_stocks.csv')

df_orig.head()

,DATE,CODE,NAME,12m Low,12m High,Day Low,Day High,Day Price,Previous,Change,Change%,Volume,Adjust,Date,Adjusted
0,1/3/2012,EQTY,Equity Bank,18.5,34.25,16.5,17.00,16.70,16.40,0.3,1.80%,"141,700",-,NaN,NaN
1,1/4/2012,EQTY,Equity Bank,18.5,34.25,16.4,16.80,16.55,16.70,-0.15,0.91%,"912,500",-,NaN,NaN
2,1/5/2012,EQTY,Equity Bank,18.5,34.25,15.8,16.75,16.15,16.55,-0.4,2.48%,"748,700",-,NaN,NaN
3,1/6/2012,EQTY,Equity Bank,18.5,34.25,15.5,16.00,15.80,16.15,-0.35,2.22%,"3,510,000",-,NaN,NaN
4,1/9/2012,EQTY,Equity Bank,18.5,34.25,15.8,16.50,15.95,15.80,0.15,0.94%,"1,090,000",-,NaN,NaN

### Clean the data by handling missing values

In [15]:
# Make a copy of the df that I will manipulate
df = df_orig.copy()

df.head()

,DATE,CODE,NAME,12m Low,12m High,Day Low,Day High,Day Price,Previous,Change,Change%,Volume,Adjust,Date,Adjusted
0,1/3/2012,EQTY,Equity Bank,18.5,34.25,16.5,17.00,16.70,16.40,0.3,1.80%,"141,700",-,NaN,NaN
1,1/4/2012,EQTY,Equity Bank,18.5,34.25,16.4,16.80,16.55,16.70,-0.15,0.91%,"912,500",-,NaN,NaN
2,1/5/2012,EQTY,Equity Bank,18.5,34.25,15.8,16.75,16.15,16.55,-0.4,2.48%,"748,700",-,NaN,NaN
3,1/6/2012,EQTY,Equity Bank,18.5,34.25,15.5,16.00,15.80,16.15,-0.35,2.22%,"3,510,000",-,NaN,NaN
4,1/9/2012,EQTY,Equity Bank,18.5,34.25,15.8,16.50,15.95,15.80,0.15,0.94%,"1,090,000",-,NaN,NaN

In [16]:
df.isna().sum()

DATE          248
CODE            0
NAME            0
12m Low         0
12m High        0
Day Low         0
Day High        0
Day Price       0
Previous        0
Change          0
Change%         0
Volume          0
Adjust        248
Date         1252
Adjusted     1252
dtype: int64

In [17]:
# Remove columns with a lot of missing values, and the Code and Name
columns = ['Adjust', 'Date', 'Adjusted', 'CODE', 'NAME']

df = df.drop(columns, axis=1)

df.head()

,DATE,12m Low,12m High,Day Low,Day High,Day Price,Previous,Change,Change%,Volume
0,1/3/2012,18.5,34.25,16.5,17.00,16.70,16.40,0.3,1.80%,"141,700"
1,1/4/2012,18.5,34.25,16.4,16.80,16.55,16.70,-0.15,0.91%,"912,500"
2,1/5/2012,18.5,34.25,15.8,16.75,16.15,16.55,-0.4,2.48%,"748,700"
3,1/6/2012,18.5,34.25,15.5,16.00,15.80,16.15,-0.35,2.22%,"3,510,000"
4,1/9/2012,18.5,34.25,15.8,16.50,15.95,15.80,0.15,0.94%,"1,090,000"

In [18]:
# Drop rows that have missing values
df = df.dropna(subset=['DATE'])

df.isna().sum()

DATE         0
12m Low      0
12m High     0
Day Low      0
Day High     0
Day Price    0
Previous     0
Change       0
Change%      0
Volume       0
dtype: int64

In [ ]:
# Convert date column to datetime type
df["DATE"] = pd.to_datetime(df['DATE'], format='%d/%m/%Y', errors='coerce')


# Extract Date Data to Different Columns
df['year'] = df['DATE'].dt.year
df['month'] = df['DATE'].dt.month
df['day'] = df['DATE'].dt.day

# Drop the date column
df = df.drop("DATE", axis=1)

df.head()

In [25]:
df.to_csv('2-equity-stocks.csv')

In [24]:
df = df.replace('-', np.nan)

df.isna().sum()

12m Low        0
12m High       0
Day Low        0
Day High       0
Day Price      0
Previous       0
Change       318
Change%      318
Volume         0
year         765
month        765
day          765
dtype: int64

In [26]:
# Remove columns with a lot of missing values, and the Code and Name
columns = ['year', 'month', 'day', 'Change%', 'Change']

df = df.drop(columns, axis=1)

df.head()

   12m Low  12m High  Day Low  Day High  Day Price  Previous     Volume
0     18.5     34.25     16.5     17.00      16.70     16.40    141,700
1     18.5     34.25     16.4     16.80      16.55     16.70    912,500
2     18.5     34.25     15.8     16.75      16.15     16.55    748,700
3     18.5     34.25     15.5     16.00      15.80     16.15  3,510,000
4     18.5     34.25     15.8     16.50      15.95     15.80  1,090,000

In [31]:
# Remove commas and convert to numeric
df['Volume'] = df['Volume'].str.replace(',', '').astype(float)

df.isna().sum()

12m Low      0
12m High     0
Day Low      0
Day High     0
Day Price    0
Previous     0
Volume       0
dtype: int64

### Prediction using Nearest Neighbors

In [32]:
from sklearn.model_selection import train_test_split


np.random.seed(42)

# Create the data
X = df.drop('Day Price', axis=1)
y = df['Day Price']

# Split the data
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

X_train.head()

     12m Low  12m High  Day Low  Day High  Previous     Volume
66     19.50     36.50    19.30      19.5     19.25  4630000.0
67     19.50     36.50    19.40      19.6     19.40  7510000.0
382    19.55     36.50    16.35      16.8     16.55  5660000.0
211    19.00     34.25    24.00      24.5     24.25  3040000.0
12     18.50     34.25    15.90      16.0     15.90  2100000.0

In [33]:
from sklearn.neighbors import KNeighborsRegressor as KNN


np.random.seed(42)

# Initiate the model
knn = KNN()

# Fit the model
knn.fit(X_train, y_train)

# Check score
knn.score(X_test, y_test)

0.4571626148893009

In [34]:
from sklearn.linear_model import LinearRegression


np.random.seed(42)

# Initiate the model
lr = LinearRegression()

# Fit the model
lr.fit(X_train, y_train)

# Check score
lr.score(X_test, y_test)

0.9997403267601818

In [39]:
from sklearn.ensemble import RandomForestRegressor as RFR


np.random.seed(42)

# Initiate the model
rf = RFR()

# Fit the model
rf.fit(X_train, y_train)

# Check score
rf.score(X_test, y_test)

0.9989781750886335